/* Learn more label text */
"<b>Learn more</b> about device management and security." = "<b>Lue lisää</b> laitteen hallinnasta ja turvallisuudesta.";

/* No comment provided by engineer. */
"A system error occurred" = "Järjestelmävirhe";

/* Account will be removed on this device at SSO Page */
"Account will be removed from %@ and other Yahoo apps on this device." = "Tilisi poistetaan sovelluksesta %@ ja muista tämän laitteen Yahoo-sovelluksista.";

/* Add Account cell in SSO Screen - Allows user to Sign-In as new user */
"Add Account" = "Lisää tili";

/* No comment provided by engineer. */
"An error occurred. Please try again later." = "Havaittiin virhe. Yritä uudelleen myöhemmin.";

/* Accessibility label for the back button */
"Back" = "Takaisin";

/* call tip prefix in 2lc */
"Call %@" = "Soitto: %@";

/* No comment provided by engineer. */
"Call again" = "Soita uudelleen";

/* Cancel
   Cancel button title */
"Cancel" = "Peruuta";

/* Fallback page cannot be loaded. */
"Cannot load page." = "Sivun lataaminen ei onnistu.";

/* Accessibility label for the close button */
"Close" = "Sulje";

/* Continue
   Continue to Safari for SHF */
"Continue" = "Jatka";

/* Create Account view title
   sign up button title */
"Create Account" = "Luo tili";

/* learn more alert title */
"Device Not Recognized" = "Laitetta ei tunnistettu";

/* No comment provided by engineer. */
"Didn't receive the email?" = "Etkö saanut sähköpostiviestiä?";

/* No comment provided by engineer. */
"Didn't receive the text message?" = "Etkö saanut tekstiviestiä?";

/* No comment provided by engineer. */
"Didn't receive the voice call?" = "Etkö saanut puhelua?";

/* Dismiss */
"Dismiss" = "Ohita";

/* Edit button title */
"Edit" = "Muokkaa";

/* No comment provided by engineer. */
"Email could not be sent" = "Sähköpostiviestin lähetys epäonnistui";

/* No comment provided by engineer. */
"Email sent" = "Sähköpostiviesti lähetetty";

/* No comment provided by engineer. */
"Enter Code" = "Anna koodi";

/* For security reasons you need to verify your account or need to change password when SHF */
"For security reasons you need to unlock your account." = "Sinun täytyy poistaa tilistäsi lukitus turvallisuussyistä.";

/* Switching to alternative sign-in interface. */
"For security reasons, please verify your account again." = "Sinun täytyy vahvistaa tilisi uudelleen turvallisuussyistä.";

/* No comment provided by engineer. */
"For the safety of your account, please login via web." = "Turvallisuutesi vuoksi kirjaudu verkon kautta.";

/* forgot password or ID title
   Sign in alert view title */
"Forgot password or ID?" = "Unohtuiko salasana/tunnus?";

/* forgot password title
   Sign in alert view title */
"Forgot password?" = "Unohtuiko salasana?";

/* No comment provided by engineer. */
"Generic Handoff" = "Yleinen vaihto";

/* Go to Account recovery */
"Get Help" = "Hae ohjeita";

/* No comment provided by engineer. */
"Incorrect answer. Try again." = "Väärä vastaus. Yritä uudelleen.";

/* No comment provided by engineer. */
"Invalid ID or password. Please try again." = "Tunnus tai salasana ei kelpaa. Yritä uudelleen.";

/* No comment provided by engineer. */
"Limit reached. Email could not be sent." = "Raja saavutettu. Sähköpostiviestin lähetys epäonnistui.";

/* No comment provided by engineer. */
"Limit reached. Unable to send text message or make a voice call." = "Raja saavutettu. Tekstiviestien lähetys tai puhelujen soitto ei ole mahdollista.";

/* 2LC Failure
   Login session has expired, please try again. */
"Login session has expired, please try again." = "Sisäänkirjautumisistunto on vanhentunut. Yritä uudelleen.";

/* Network error alert view title */
"Network unavailable." = "Verkko ei ole käytettävissä.";

/* OK
   OK Button title
   ok button title */
"OK" = "OK";

/* password text field place holder */
"Password" = "Salasana";

/* 2LC password prompt str */
"Please enter your password for \n%@" = "Anna salasana: %@";

/* Remove the account
   SSO remove account title */
"Remove" = "Poista";

/* Remove an account label on SSO screen */
"Remove an account" = "Poista tili";

/* Select an account label on SSO screen */
"Select an account" = "Valitse tili";

/* account token invalid sign in problem */
"Session expired, please sign-in again." = "Istunto on vanhentunut. Kirjaudu uudelleen sisään.";

/* sign in button title */
"Sign In" = "Kirjaudu sisään";

/* 3PA Label */
"Sign in with <a>Facebook</a> or <b>Google</b>" = "Kirjaudu sisään <a>Facebook-</a> tai <b>Google-tunnuksella</b>";

/* Zero tap alert signed in as */
"Signed in as" = "Olet kirjautunut käyttäjänimellä";

/* signing in state title for sign in button */
"Signing In" = "Kirjaudutaan sisään";

/* No comment provided by engineer. */
"Sorry, the system is down. Please try again later." = "Järjestelmä ei ole käytettävissä. Yritä uudelleen myöhemmin.";

/* No comment provided by engineer. */
"Sorry, we can't sign you in now. Please try again later." = "Sinua ei tällä hetkellä voida kirjata sisään. Yritä uudelleen myöhemmin.";

/* sms tip prefix in 2lc */
"Text %@" = "Tekstiviesti: %@";

/* No comment provided by engineer. */
"Text message could not be sent" = "Tekstiviestin lähetys epäonnistui";

/* No comment provided by engineer. */
"Text message sent" = "Tekstiviesti lähetetty";

/* No comment provided by engineer. */
"The Second Challenge state data could not be extracted from the Short-Lived Challenge Credential" = "Toisen testin tietoja ei pystytty noutamaan SLCC-tiedoista.";

/* Second Login Challenge Error - user entered the code wrong too many times. */
"Too many attempts. Try again in 24 hours." = "Liian monta yritystä. Yritä uudelleen 24 tunnin kuluttua.";

/* No comment provided by engineer. */
"Try again" = "Yritä uudelleen";

/* No comment provided by engineer. */
"Unable to place a voice call" = "Puhelun soitto epäonnistui";

/* SSL Certificate Error - Please Check Date/Time */
"Unable to sign in. Check system date and try again." = "Sisäänkirjautuminen ei onnistu. Tarkista järjestelmän päivämäärä ja yritä uudelleen.";

/* Token handoff failure */
"Unable to sign in. Please try again." = "Sisäänkirjautuminen ei onnistunut. Yritä uudelleen.";

/* Create Account view title
   View title - appears in the navigation \
                                                                                                                    bar containing the webview that displays the account upgrade flow */
"Update Account" = " Päivitä tili";

/* Migrate 3PA Account view title */
"Upgrade to Yahoo" = "Ota Yahoo käyttöösi";

/* User already signed-in */
"User %@ is already signed in" = "Käyttäjä %@ on jo kirjautunut sisään";

/* User already signed-in */
"User already signed-in" = "Käyttäjä on jo kirjautunut sisään";

/* 2LC aea verify prompt text
   2LC sms verify prompt text */
"Verification code sent to %@" = "Vahvistuskoodi lähetetty: %@";

/* No comment provided by engineer. */
"Voice call in progress" = "Puhelu meneillään.";

/* 2LC voice verify prompt text */
"We called you with a verification code at %@" = "Annoimme vahv.koodin puhelimitse nro:ssa %@";

/* No comment provided by engineer. */
"We do not recognize this device. Please verify your identity by answering your security question." = "Tätä laitetta ei tunnistettu. Vahvista henkilöllisyytesi vastaamalla määrittämääsi turvakysymykseen.";

/* No comment provided by engineer. */
"We do not recognize this device. Please verify your identity. We will send a verification code." = "Tätä laitetta ei tunnistettu. Vahvista henkilöllisyytesi. Sinulle lähetetään vahvistuskoodi.";

/* ID text field place holder */
"Yahoo ID" = "Yahoo-tunnus";

/* No comment provided by engineer. */
"You must be at least 13 years old." = "Sinun on oltava vähintään 13 vuoden ikäinen.";

/* Unlock success */
"Your account is now unlocked. Please sign in." = "Tilisi lukitus on nyt avattu. Kirjaudu sisään.";

/* No comment provided by engineer. */
"Your Answer" = "Vastauksesi";

/* learn more alert msg line 1 */
"• New device?" = "• Uusi laite?";

/* learn more alert msg line 3 */
"• Opted for sign in verification?" = "• Valitsitko kirjautumisvahvistuksen?";

/* learn more alert msg line 2 */
"• Signing in from a new country?" = "• Kirjaudutko sisään eri maasta?";

